Revit 2024 API
StairsType.NotchVerticalGap Property
 The width of the vertical gap in the stairs notch.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public double NotchVerticalGap { get; set; }
Visual Basic
Public Property NotchVerticalGap As Double
	Get
	Set
Visual C++
public:
property double NotchVerticalGap {
	double get ();
	void set (double value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The given value for notchVerticalGap must be between 0 and 30000 feet.
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: The construction method of the stairs type is not "Precast" or the StairsEndConnectionType of the stairs type is not "Notch", so this related data cannot be set.
See Also
StairsType Class
Autodesk.Revit.DB.Architecture Namespace